# #51: Seleksi baris dengan `between()`

## Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan Data Frame

In [8]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  4  1  6  3
1  1  1  4  7  4
2  9  7  2  2  2
3  3  7  9  4  4
4  8  6  3  5  8
5  2  8  4  1  9
6  5  8  9  1  6
7  9  4  4  2  3
8  8  8  6  2  9
9  8  8  7  2  7

## Seleksi baris dengan `between()`

In [10]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
0  2  4  1  6  3
3  3  7  9  4  4
5  2  8  4  1  9
6  5  8  9  1  6

In [ ]:
## DEPRICATED ##
# df[df['A'].between(2, 5, inclusive=False)]

In [16]:
df[df['A'].between(2, 5, inclusive='left')]

   A  B  C  D  E
0  2  4  1  6  3
3  3  7  9  4  4
5  2  8  4  1  9

In [18]:
df[df['A'].between(2, 5, inclusive='right')]

   A  B  C  D  E
3  3  7  9  4  4
6  5  8  9  1  6

In [20]:
df[df['A'].between(2, 5, inclusive='both')]

   A  B  C  D  E
0  2  4  1  6  3
3  3  7  9  4  4
5  2  8  4  1  9
6  5  8  9  1  6

In [22]:
df[df['A'].between(2, 5, inclusive='neither')]

   A  B  C  D  E
3  3  7  9  4  4